{
  "months": {
    "january": "Enero",
    "february": "Febrero",
    "march": "Marzo",
    "april": "Abril",
    "may": "Mayo",
    "june": "Junio",
    "july": "Julio",
    "august": "Agosto",
    "september": "Septiembre",
    "october": "Octubre",
    "november": "Noviembre",
    "december": "Diciembre"
  },
  "sidenav": {
    "profession": "Desarrollador Frontend",
    "about": "Acerca de mi",
    "skills": "Habilidades",
    "experience": "Experiencia",
    "education": "Estudios",
    "contact": "Contacto"
  },
  "about": {
    "bioFirstPart": " ¡Hola! Soy Ricardo, desarrollador Front End y de aplicaciones multiplataforma.",
    "bioSecondPart": "Desde temprana edad, la creatividad ha sido mi compañera constante. Aunque admito que tomé algunas decisiones académicas equivocadas en el camino, finalmente encontré mi verdadera pasión. Descubrí que mi corazón estaba en la programación y me lancé de lleno a explorar este emocionante mundo. Este cambio fue, sin duda, el llamado que siempre había estado esperando.",
    "bioThirdPart": "En esta página encontrarás más información sobre mí.",
    "bioFourthPart": "¡Gracias por visitarla!",
    "back": "Volver",
    "resume": "Curriculum",
    "downloadResume": "Descargar CV",
    "guitar": {
      "title": "Guitarra",
      "description": "Desde niño, mi abuelo, quien también era músico, inculcó en mí la pasión por la guitarra y la música. Esta pasión ha perdurado a lo largo de los años, recordándome que la música es una herencia preciosa que trasciende generaciones."
    },
    "code": {
      "title": "Programación",
      "description": "Lo que comenzó como una mera curiosidad se ha transformado en mi mayor pasión: la programación. Cada línea de código representa un emocionante desafío y una oportunidad para crear. Esta evolución me impulsa constantemente a aprender y explorar nuevas tecnologías."
    },
    "movies": {
      "title": "Cine",
      "description": "Disfruto enormemente del cine, especialmente del género zombie, ya que crecí fascinado por este tipo de películas. Las historias apocalípticas y llenas de suspenso me han cautivado desde pequeño, creando una conexión duradera con este género cinematográfico. Cada película me sumerge en emocionantes universos de desafíos y supervivencia."
    },
    "videogames": {
      "title": "Videojuegos",
      "description": "Soy un amante de los videojuegos, especialmente del género survival horror. Mi saga favorita es Resident Evil, ya que me encanta explorar mundos aterradores, resolver enigmas y enfrentar desafíos emocionantes mientras experimento historias de supervivencia intensas."
    },
    "livedIn": "Viví en",
    "languages": "Idiomas",
    "spanish": "Español",
    "english": "Inglés"
  },
  "skills": {
    "hardSkills": {
      "markupLanguages": "Lenguajes de marcado",
      "stylesheetLanguages": "Lenguajes de estilo",
      "programmingLanguages": "Lenguajes de programación",
      "frontendLibraries": "Librerías y Frameworks",
      "frameworksEnvironments": "Frameworks y entornos",
      "databases": "Bases de datos",
      "versionControl": "Control de versiones",
      "otherTools": "Otras herramientas"
    },
    "softSkills": {
      "problemSolving": "Resolución de problemas",
      "selfManagement": "Autogestión",
      "abilityToTeach": "Capacidad para enseñar",
      "teamwork": "Trabajo en equipo",
      "adaptability": "Adaptabilidad"
    }
  },
  "experience": {
    "month": "meses",
    "year": "año",
    "currently": "Actualmente",
    "position": "Puesto",
    "responsibilities": "Responsabilidades",
    "appliedSkills": "Habilidades aplicadas",
    "learning": "Aprendizajes",
    "challenges": "Desafíos",
    "companies": {
      "cyc": {
        "description": "CYC es una consultora tecnológica especializada en proyectos de transformación digital. Ayudan a las organizaciones a mejorar su competitividad y su forma de trabajar.",
        "position": "Desarrollador Front End",
        "responsibilities": "Desarrollo de soluciones e intranets para diferentes clientes utilizando el entorno de Microsoft SharePoint y el framework SPFx con React y Typescript. Uso de metodologías Ágiles y control de versiones con Git y Azure DevOps.",
        "learning": "En CYC aprendí a programar en el framework SPFx de Microsoft utilizando React. También tuve la oportunidad de aprender las bases de C#. Tuve mis primeras reuniones con clientes y aprendí a trabajar en equipo con otros desarrolladores realizando reuniones diarias de control.",
        "challenges": "El principal reto que tuve en CYC fue aprender todo el entorno de desarrollo de Microsoft SharePoint, el framework SPFx y todas las herramientas que ofrece, pero me adapté rápidamente a el y pude realizar mi trabajo de forma eficiente."
      },
      "theBridge": {
        "description": "The Bridge ofrece programas formativos tipo bootcamp en Desarrollo Web Full Stack, Data Science, UX/UI Product Design, Marketing Digital, Ciberseguridad y Cloud & DevOps.",
        "position": "Asistente de profesor",
        "responsibilities": "Asistente de profesor en el bootcamp de desarrollo web fullstack en modalidad part-time. Apoyé a los instructores con las dudas que tenían los estudiantes y ayudé a resolver los ejercicios propuestos en el pensum.",
        "learning": "El principal aprendizaje que me he llevado de mi paso por The Bridge es la capacidad de enseñar a otros y la paciencia que hay que tener para ello. También aprendí a trabajar en equipo con otros profesores y a resolver problemas de forma rápida y eficiente.",
        "challenges": "Uno de los retos al que me tuve que afrontar en este trabajo fue el de enseñar a otros a programar, ya que no es una tarea fácil. Pero con el tiempo y la práctica, aprendí a hacerlo de forma eficiente y disfruté mucho haciéndolo."
      },
      "cleverpy": {
        "description": "Cleverpy es parte de la empresa Idrica, la cual lidera el desarrollo de una plataforma integrada de software y análisis que permite a las empresas de servicios públicos como el agua potable a conectar y gestionar sus activos digitales y agilizar las operaciones de forma sencilla, segura y holística.",
        "position": "Desarrollador Front End",
        "responsibilities": "Desarrollo de la plataforma 'Go-Aigua' de la empresa IDRICA para la gestión del agua que captura, procesa, homogeneiza y explota los datos de múltiples fuentes. Esta plataforma da respuesta a los retos del ciclo del agua, para todos los sectores y fases operativas, impulsando la eficiencia y optimizando la operación.",
        "learning": "En Cleverpy aprendí, sobre todo, a ser más autosuficiente y a resolver problemas investigando por mi cuenta. Aprendí nuevas librerías de mapas y he afianzado mis conocimientos en React con TypeScript. También aprendí mucho sobre el ciclo del agua y la gestión de los recursos hídricos.",
        "challenges": "El principal reto que tuve en Cleverpy fue el de aprender el proceso de gestión del agua y la plataforma, ya que es un proyecto muy grande y complejo. Pero con el tiempo, la práctica y la ayuda de mis compañeros, no tuve problema en volverme autosuficiente y realizar mi trabajo de forma eficiente."
      }
    }
  },
  "education": {
    "downloadDiploma": "Descargar diploma",
    "inProgress": "Actualmente estudiando",
    "ilerna": {
      "name": "Ilerna Online",
      "date": "2022 - 2024",
      "degree": "Grado Superior en Desarrollo de Aplicaciones Multiplataforma",
      "description": "Actualmente estoy haciendo un FP oficial de Desarrollo de Aplicaciones Multiplataforma. Mi objetivo es aprender a desarrollar aplicaciones móviles nativas. Aprendo los fundamentos de Java, progrmación orientada a objetos y bases de datos relacionales y no relacionales."
    },
    "theBridge": {
      "name": "The Bridge",
      "date": "2021 - 2022",
      "degree": "Bootcamp de Desarrollo Web Fullstack",
      "description": "En este bootcamp aprendí las bases de la programación web. Fueron 4 meses muy intensos y desafiantes en los cuales perfeccioné mis conocimientos en HTML, CSS y Javascript y además, aprendí la librería React. También aprendí la parte backend con Node.js y Express."
    },
    "cei": {
      "name": "CEI",
      "date": "2019 - 2020",
      "degree": "Desarrollo y maquetación de páginas web.",
      "description": "Decidí realizar este módulo para aprender el CMS WordPress, y al finalizar la primera mitad del módulo me dió mucha curiosidad en saber cómo están hechas las webs, así que decidí continuar con el módulo de HTML, CSS y JavaScript, con el cual quedé maravillado."
    },
    "trazos": {
      "name": "Trazos",
      "date": "2016 - 2017",
      "degree": "Máster en 3D generalista.",
      "description": "Luego de terminar mi carrera universitaria, decidí venir a Madrid para continuar con mis estudios en modelado y animación digital 3D. Fue entonces que hice un máster en 3D Generalista en el que perfeccioné mis conocimientos en el software Autodesk Maya, entre otros."
    },
    "udla": {
      "name": "UDLA",
      "date": "2012 - 2015",
      "degree": "Ilustración y Animación Digital 2D y 3D",
      "description": "Mis estudios profesionales empezaron cuando decidí, tras varios desaciertos, estudiar la carrera que me introdujo en el mundo del diseño digital. Aquí aprendí ilustración, storyboarding, fotografía y a manejar varios programas como Photoshop, Illustrator, After Effects, Autodesk Maya."
    }
  }
}
