{
  "months": {
    "january": "January",
    "february": "February",
    "march": "March",
    "april": "April",
    "may": "May",
    "june": "June",
    "july": "July",
    "august": "August",
    "september": "September",
    "october": "October",
    "november": "November",
    "december": "December"
  },
  "sidenav": {
    "profession": "Frontend Developer",
    "about": "About",
    "skills": "Skills",
    "experience": "Experience",
    "education": "Education",
    "contact": "Contact"
  },
  "about": {
    "bioFirstPart": "Hello! I'm Ricardo, a Front End developer and cross-platform applications.",
    "bioSecondPart": "From a young age, creativity has been my constant companion. While I'll admit to making some misguided academic choices along the way, I ultimately discovered my true passion. I found that my heart was in programming, and I wholeheartedly dove into exploring this thrilling world. This change was undoubtedly the calling I had been waiting for.",
    "back": "Go back",
    "resume": "Resume",
    "downloadResume": "Download Resume",
    "viewDetails": "/Click to view details",
    "guitar": {
      "title": "Guitar",
      "description": "From childhood, my grandfather, who was also a musician, instilled in me the passion for the guitar and music. This passion has endured throughout the years, reminding me that music is a precious heritage that transcends generations."
    },
    "code": {
      "title": "Code",
      "description": "What started as a mere curiosity has transformed into my greatest passion. Each line of code represents an exciting challenge and an opportunity to create. Every day I'm learning and exploring new technologies."
    },
    "movies": {
      "title": "Movies",
      "description": "I greatly enjoy cinema, especially the zombie genre, as I grew up fascinated by these types of movies. The apocalyptic and suspenseful stories have captivated me since I was young."
    },
    "videogames": {
      "title": "Video games",
      "description": "I am a lover of survival horror genre. My favorite series is Resident Evil, as I enjoy exploring terrifying worlds, solving puzzles, and facing exciting challenges while experiencing intense survival stories."
    },
    "livedIn": "Lived in",
    "languages": "Languages",
    "spanish": "Spanish",
    "english": "English"
  },
  "skills": {
    "hardSkills": {
      "markupLanguages": "Markup languages",
      "stylesheetLanguages": "Stylesheet languages",
      "programmingLanguages": "Programming languages",
      "frontendLibraries": "Libraries & Frameworks",
      "frameworksEnvironments": "Frameworks environments",
      "databases": "Databases",
      "versionControl": "Version control",
      "otherTools": "Other tools"
    },
    "softSkills": {
      "problemSolving": "Problem solving",
      "selfManagement": "Self management",
      "abilityToTeach": "Ability to teach",
      "teamwork": "Teamwork",
      "adaptability": "Adaptability"
    }
  },
  "experience": {
    "month": "month",
    "year": "year",
    "currently": "Currently",
    "position": "Position",
    "responsibilities": "Responsibilities",
    "appliedSkills": "Applied skills",
    "learning": "Learning",
    "challenges": "Challenges",
    "companies": {
      "cyc": {
        "description": "CYC is a technology consulting firm specialized in digital transformation projects. They help organizations to improve their competitiveness and the way they work.",
        "responsibilities": "Intranets and solutions development for different clients using Microsoft SharePoint environment and SPFx framework with React and Typescript.",
        "learning": "At CYC I learned to program in Microsoft's SPFx framework using React. I also had the opportunity to learn the basics of C#. I had my first meetings with clients and learned to work in a team with other developers in daily monitoring meetings.",
        "challenges": "The main challenge I had at CYC was learning the whole Microsoft SharePoint development environment, the SPFx framework and all the tools it offers, but I adapted quickly and was able to perform my job effectively."
      },
      "theBridge": {
        "description": "The Bridge offers bootcamp training programs in Full Stack Web Development, Data Science, UX/UI Product Design, Digital Marketing, Cybersecurity and Cloud & DevOps.",
        "position": "Teacher assistant",
        "responsibilities": "Teacher Assistant in the Fullstack Web Development bootcamp in part-time mode. I support the Lead Instructor with the doubts that the students have and help to solve the exercises proposed in the curriculum.",
        "learning": "The main learning I have taken away from my time at The Bridge is the ability to teach others and the patience it takes to do so. I also learned how to work as a team with other teachers and how to solve problems quickly and efficiently.",
        "challenges": "One of the challenges I had to face in this job was to teach others how to program, as it is not an easy task. But with time and practice, I learned to do it efficiently and I really enjoyed doing it."
      },
      "cleverpy": {
        "description": "Cleverpy is part of the company Idrica, which is leading the development of an integrated software and analytics platform that enables utilities such as water utilities to connect and manage their digital assets and streamline operations in a simple, secure and holistic way.",
        "position": "Front End Developer",
        "responsibilities": "Development of the 'Go-Aigua' platform for IDRICA company for water management that captures, processes, homogenizes and exploits data from multiple sources. This platform responds to the challenges of the water cycle, for all sectors and operational phases, promoting efficiency and optimizing operations.",
        "learning": "In Cleverpy I learned, above all, to be more self-sufficient and to solve problems by researching on my own. I learned new map libraries and have solidified my knowledge in React with TypeScript. I also learned a lot about the water cycle and water resource management.",
        "challenges": "The main challenge I had at Cleverpy was learning the water management process and the platform, as it is a very large and complex project. But with time, practice and the help of my colleagues, I had no problem becoming self-sufficient and doing my job."
      }
    }
  },
  "education": {
    "downloadDiploma": "Download diploma",
    "inProgress": "In progress",
    "startingYear": "Start year",
    "yearsOfStudy": "years of study",
    "ilerna": {
      "name": "Ilerna Online",
      "degree": "Cross-platform application development",
      "description": "I am currently doing an official FP in Multiplatform Application Development. My goal is to learn how to develop native mobile applications. I learn the basics of Java as well as relational and non-relational databases."
    },
    "theBridge": {
      "name": "The Bridge",
      "degree": "Full Stack Web Development Bootcamp",
      "description": "In this bootcamp I learned the basics of web programming. It was a very intense and challenging 4 months in which I perfected my knowledge in HTML, CSS and Javascript and also learned React library. I also learned the backend with Node.js and Express."
    },
    "cei": {
      "name": "CEI",
      "degree": "Higher Degree Training Cycle in Web Application Development",
      "description": "I decided to take this module to learn the WordPress CMS, and after finishing the first half of the module I was very curious to know how the websites are made, so I decided to continue with the HTML, CSS and JavaScript module, with which I was amazed."
    },
    "trazos": {
      "name": "Trazos",
      "degree": "3D Generalist Master",
      "description": "After finishing my university career, I decided to come to Madrid to continue my studies in 3D digital modeling and animation. It was then that I did a master's degree in 3D Generalist in which I perfected my knowledge in Autodesk Maya software, among others."
    },
    "udla": {
      "name": "UDLA",
      "degree": "2D and 3D Digital Illustration and Animation.",
      "description": "My professional studies began when I decided, after several setbacks, to study the career that introduced me to the world of digital design. Here I learned illustration, storyboarding, photography and how to handle various programs such as Photoshop, Illustrator, After Effects, Autodesk Maya."
    }
  }
}
